#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>
#include <sys/mman.h>
#include <fcntl.h>
#include <string.h>

int main() {
    // 创建内存映射区
    int fd = open("test.txt", O_RDWR);
    if (fd == -1) {
        perror("open");
        return -1;
    }
    int size = lseek(fd, 0, SEEK_END);
    /* 创建内核映射区：
        4g  |---------------------------------------------|
        内  |   内存管理                                    |   
        核  |进程管理(PCB进程控制块结构体中有一个文件描述符表数组) | 
        区  |   设备驱动管理                                | 
            |    vfs虚拟文件系统                            | 
        3g  |---------------------------------------------| 
            |   当前用户的环境变量(env指令查看)                | 
            |---------------------------------------------| 
            |     命令行参数                                | 
            |---------------------------------------------| 
            |                                             | 
            |  栈空间(小)   向下增长                         | 
            |                                             | 
            |---------------------------------------------| 
            |                                             | 
        用  |  共享库(C标准库、linux IO库、动态库)            |   -----> 内核映射区
        户  |---------------------------------------------| 
        区  |                                             | 
            |                                             | 
            |   堆空间(大)   向上增长                        | 
            |                                             | 
            |                                             | 
            |---------------------------------------------| 
            |     .bss 未初始化全局变量                      | 
            |---------------------------------------------| 
            |     .data 已初始化全局变量                     | 
            |---------------------------------------------| 
            |     .text 代码区(二进制代码)                   | 
        4K  |---------------------------------------------| 
            |     受保护的地址                              | 
            |---------------------------------------------|
    */
    void *ptr  = mmap(NULL, size, PROT_READ | PROT_WRITE, MAP_SHARED, fd, 0);
    if (ptr == MAP_FAILED) {
        perror("mmap");
        exit(-1);
    }
    // 读数据
    char buf[64];
    strcpy(buf, (void *)ptr);
    printf("%s", buf);
    // 关闭内存映射区
    munmap(ptr, size);

    return 0;
}